{
  "Ibu9p6-QMDj6YcB9CPqi0w": {
    "userName": "Melissa R.",
    "content": "Professional, timely and very knowledgeable. My husband and I are so happy with the work that Mike did! Our carpets are looking and smelling great. Stains that I thought were lost causes were lifted and we were informed on how to manage them if they appear in the future. I will be sure to call Carpet Geeks in the future and refer others to this business."
  },
  "rue6RKvykZhAYS3LEGlPEw": {
    "userName": "Mike T.",
    "content": "I am really thrilled with Mike's service.  He got out several troublesome stains and gave me great tips on how to take care of pet mishaps in the future.  Best of all HE WAS ON TIME AS PROMISED!  He is professional and thorough.  His pricing is really fair.  I will definitely use him again."
  },
  "KGG_dcaO3jejKfXYCKD5jQ": {
    "userName": "Kerry P.",
    "content": "All went very well.  He was right on time.  Came on Saturday for us - we needed a rush job.  Everything looks great and I will use them again."
  },
  "petDamage1": {
    "userName": "Cara S.",
    "content": "Excellent response time to a concern about pet damage and they were able to schedule me same week. This is the second time I have used them and I am very impressed with the results. The spots we had this time were black, and as you can see from our after photo (no before, sorry) that the skill is remarkable! I will continue to use them as no carpet is safe from dogs and kids, amirite??? Also the odor is gone!!"
  },
  "R20vLw8JU80krBtxh0ihKg": {
    "userName": "Jeff P.",
    "content": "Very pleased with his work. Explained everything and was efficient and removed the stain from our couch and it looks like new!  Felt like price was great and much cheaper than last time we had our couch cleaned from a different company. Will use again for sure for all steam cleaning needs."
  },
  "fOmvp8iRSSlWRJhoSLVd8w": {
    "userName": "Marg M.",
    "content": "Mike with Carpet Geeks just left after thoroughly cleaning my 3 bedrooms. He is so knowledgeable about all things carpet, as well as friendly and very professional. Carpet Geeks is my new 'go to' for carpet cleaning (and he stretches sagging carpets too). Great job at a reasonable price!"
  },
  "IOB11QGS": {
    "userName": "Kathy W.",
    "content": "Very happy with the carpet cleaning work Mike did for us.  He was friendly, did a great job and left my carpet clean and will certainly use his company again."
  },
  "y2pd6_": {
    "userName": "Darby B.",
    "content": "Mike did an awesome job for us on short notice. He went out of his way to make our carpets look great as we put our house on the market. We had some pet stains, wear and tear, and some carpet stretching needed. He did such an amazing job, at a really affordable price. I would HIGHLY recommend trying Carpet Geeks. We have used ZeroRez, ChemDry in the past and felt we got a better bang for our buck with Carpet Geeks. My concern of \"drying time\" was pretty silly as they dried so fast. \n Thanks for doing a great job for us, Mike!"
  },
  "KlyAFoMFGQrEcf": {
    "userName": "Clare B.",
    "content": "These guys really are the Geeks of carpet cleaning. They know their stuff! My carpets always end up looking like new after they are here. They are fast, friendly, and affordable. I would highly recommend them."
  },
  "NNRI9E7upjH30TWMqwAjew": {
    "userName": "Jaimy - Sherine B.",
    "content": "I cannot say enough good things about Mike! He does an amazing job on all our listings. Plus, he really goes the extra mile to ensure his customers are happy. And we are! Time and time again. We highly recommend using Carpet Geeks! You will be extremely glad you did!"
  },
  "mG2Z_XqT6Zg0aONRGM55Q": {
    "userName": "Shawn V.",
    "content": "I'm incredibly impressed with Mike Perryman and Carpet Geeks! \n\nI called Mike yesterday to inquire about carpet cleaning services for my furniture store. He was so professional on the phone and made me feel very confident in his services. I expected him to be booked out quite a while, but I needed service pretty fast, and he gave me several options...he could come out after hours if we gave him access, or he could meet me first thing this morning. I opted for this morning, a Saturday! \n\nMike was on time for our appointment which speaks volumes to me! He got right to work in order to finish in a timely manner so we could open the store on time. He had quoted an hour, maybe two of cleaning, but he finished in 35 minutes! He's good!!\n\nThere is one spot that wouldn't come clean, and he took the time to explain to me why it wouldn't come clean and what we can do in the future to prevent such stains.\n\nHe gave me a very fair price quite before beginning work. His price seemed beyond reasonable, so of course I gave him the green light. I expected him to ask for payment when he was done, but he offered to email me an invoice so we could send a check.\n\nI loved everything about the experience with Mike and will certainly be calling him back again and again!\n\nThanks Mike!!"
  }
}
